In [3]:
import pandas as pd
import numpy as np

In [4]:
#Creating a dataframe of size 10,5 
df = pd.DataFrame(np.random.randint(1,100,(10,5)))
df

    0   1   2   3   4
0  18  91  93  91  94
1   3  68   8  86  53
2  62  21  94  80  64
3  54  34  21  48  87
4  61  53  34  27  99
5  19   9  39  50  60
6   8  20  89  91  56
7  12  83  96  78  67
8   4  12  37  50  74
9  20  12   7  49  40

In [13]:
#Grabbing values from column 3
df[3]

0    88
1    77
2    90
3    35
4     9
5     6
6    14
7    75
8    14
9    56
Name: 3, dtype: int64

In [14]:
#Grabbing values from multiple columns
df[[3,4]]

    3   4
0  88   3
1  77  66
2  90  80
3  35  77
4   9  75
5   6  32
6  14  38
7  75  47
8  14  73
9  56  70

In [15]:
#Creating a dataframe with our own labels
myDF = pd.DataFrame(np.random.randint(1,100,(5,5)), ['A','B','C','D','E'], ['V','W','X','Y','Z'])
myDF

    V   W   X   Y   Z
A  46  24  41  36  61
B  87  26  43  69  22
C  55  37  71  87  77
D  58   4  64  73  58
E  55  29  18  11   1

In [16]:
#Grabbing column values via column index
myDF['X']

A    41
B    43
C    71
D    64
E    18
Name: X, dtype: int64

In [17]:
myDF['X']['C']

71

In [18]:
#Number of rows and columns in a dataframe
df.shape

(10, 5)

In [19]:
myDF.shape

(5, 5)

In [20]:
#Number of dimensions
#A dataframe always has two dimensions
df.ndim

2

In [21]:
#Adding a new column to the dataframe
myDF['Q'] = [0 ,5, 7, 2, 5]

In [22]:
myDF

    V   W   X   Y   Z  Q
A  46  24  41  36  61  0
B  87  26  43  69  22  5
C  55  37  71  87  77  7
D  58   4  64  73  58  2
E  55  29  18  11   1  5

In [23]:
#Dropping the column Q from the dataframe temporarily
myDF.drop('Q', axis=1)

    V   W   X   Y   Z
A  46  24  41  36  61
B  87  26  43  69  22
C  55  37  71  87  77
D  58   4  64  73  58
E  55  29  18  11   1

In [24]:
myDF

    V   W   X   Y   Z  Q
A  46  24  41  36  61  0
B  87  26  43  69  22  5
C  55  37  71  87  77  7
D  58   4  64  73  58  2
E  55  29  18  11   1  5

In [25]:
#Dropping the column Q from the dataframe permanently

myDF.drop('Q', axis=1, inplace=True)

In [26]:
myDF

    V   W   X   Y   Z
A  46  24  41  36  61
B  87  26  43  69  22
C  55  37  71  87  77
D  58   4  64  73  58
E  55  29  18  11   1

In [27]:
#Grabbing a row from the dataframe
myDF.loc['B']

V    87
W    26
X    43
Y    69
Z    22
Name: B, dtype: int64

In [28]:
#Grabbing a row via its index from the dataframe
myDF.iloc[0]

V    46
W    24
X    41
Y    36
Z    61
Name: A, dtype: int64

In [29]:
#Grabbing multiple rows from the dataframe
myDF.loc[['C','E']]

    V   W   X   Y   Z
C  55  37  71  87  77
E  55  29  18  11   1

In [31]:
#Grabbing a section of the dataframe
myDF.loc[['C','E'],['W','X','Y']]

    W   X   Y
C  37  71  87
E  29  18  11

In [32]:
myDF

    V   W   X   Y   Z
A  46  24  41  36  61
B  87  26  43  69  22
C  55  37  71  87  77
D  58   4  64  73  58
E  55  29  18  11   1

In [33]:
myDF>50

       V      W      X      Y      Z
A  False  False  False  False   True
B   True  False  False   True  False
C   True  False   True   True   True
D   True  False   True   True   True
E   True  False  False  False  False

In [42]:
myDF['W']

A    24
B    26
C    37
D     4
E    29
Name: W, dtype: int64

In [45]:
myDF['W']<30

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [51]:
newdf = myDF[myDF['W']<30]
newdf

    V   W   X   Y   Z
A  46  24  41  36  61
B  87  26  43  69  22
D  58   4  64  73  58
E  55  29  18  11   1

In [54]:
resultdf = myDF[myDF['W']<30][['X','Y']]
resultdf

    X   Y
A  41  36
B  43  69
D  64  73
E  18  11

In [55]:
myList = ['W', 'O', 'R', 'K']
resultdf['Word'] = myList
resultdf

    X   Y Word
A  41  36    W
B  43  69    O
D  64  73    R
E  18  11    K

In [56]:
resultdf.set_index('Word')

       X   Y
Word
W     41  36
O     43  69
R     64  73
K     18  11

# Multi Indexing

In [8]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))

hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [9]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [10]:
myMultiIndex = pd.DataFrame(np.random.randint(1,100,(6,2)), hier_index, ['A','B'])
myMultiIndex

       A   B
G1 1  54  85
   2  64  53
   3  39  20
G2 1  75  28
   2  80  33
   3  44  70

In [11]:
myMultiIndex.loc['G1']

    A   B
1  54  85
2  64  53
3  39  20

In [12]:
myMultiIndex.loc['G1'].loc[2]

A    64
B    53
Name: 2, dtype: int64

# Missing Values

In [15]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3] }
dictDf = pd.DataFrame(d)
dictDf

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
dictDf.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [17]:
dictDf.sort_values('B')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
dictDf.dropna()

     A    B  C
0  1.0  5.0  1

In [15]:
dictDf

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
dictDf.dropna(axis=1)

   C
0  1
1  2
2  3

In [17]:
dictDf.fillna("FILL VALUE")

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [18]:
dictDf.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

# GroupBy

In [10]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [3]:
df['Sales'].sum()

1377

In [4]:
df['Sales'].mean()

229.5

In [5]:
df['Sales'].count()

6

In [6]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [8]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [9]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [10]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [12]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

# Concat

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [22]:
newdf = pd.concat([df1, df2, df3])
newdf

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [23]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merge

In [6]:
stdDict = {'Roll':[1, 2, 3, 4], 'Name':['ABC', 'PQR', 'XYZ', 'JKL'], 'Gender':['M', 'F', 'F', 'M']}

stdDf = pd.DataFrame(stdDict)
stdDf

   Roll Name Gender
0     1  ABC      M
1     2  PQR      F
2     3  XYZ      F
3     4  JKL      M

In [7]:
marksDict = {'Roll':[1, 2, 3], 'Subject':['Eng', 'Python', 'JAVA'], 'Marks':[50, 75, 60]}

marksDf = pd.DataFrame(marksDict)
marksDf

   Roll Subject  Marks
0     1     Eng     50
1     2  Python     75
2     3    JAVA     60

In [37]:
pd.merge(stdDf, marksDf, on='Roll')

   Roll Name Gender Subject  Marks
0     1  ABC      M     Eng     50
1     2  PQR      F  Python     75
2     3  XYZ      F    JAVA     60

In [38]:
pd.merge(stdDf, marksDf, on='Roll', how='outer')

   Roll Name Gender Subject  Marks
0     1  ABC      M     Eng   50.0
1     2  PQR      F  Python   75.0
2     3  XYZ      F    JAVA   60.0
3     4  JKL      M     NaN    NaN

In [11]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [12]:
df['Company'].unique()

array(['GOOG', 'MSFT', 'FB'], dtype=object)

In [13]:
df['Company'].nunique()

3

In [14]:
df['Company'].value_counts()

MSFT    2
FB      2
GOOG    2
Name: Company, dtype: int64

In [18]:
df.sort_values('Sales')

  Company   Person  Sales
1    GOOG  Charlie    120
3    MSFT  Vanessa    124
0    GOOG      Sam    200
4      FB     Carl    243
2    MSFT      Amy    340
5      FB    Sarah    350

In [19]:
def times10(x):
    return x*10

df['Sales'].apply(times10)

0    2000
1    1200
2    3400
3    1240
4    2430
5    3500
Name: Sales, dtype: int64

In [20]:
df['Sales'].apply(lambda x:x*10)

0    2000
1    1200
2    3400
3    1240
4    2430
5    3500
Name: Sales, dtype: int64